In [1]:
import pandas as pd
import numpy as np

C:\Users\HP\anaconda3\lib\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

In [2]:
data_none = None

In [3]:
print(type(None))

<class 'NoneType'>

In [4]:
assert data_none

AssertionError:

In [5]:
data_lst = [1,2,3,None]
sum(data_lst) / len(data_lst)

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

# Numpy - NaN

In [6]:
data_nan = np.nan

In [7]:
type(data_nan)

float

In [8]:
assert data_nan

In [9]:
np.nan is np.NaN is np.NAN

True

In [10]:
dat_a = np.array([1,2,3,np.nan])
print(np.mean(dat_a))

nan

In [11]:
np.nanmean(np.array([1,2,3,np.nan]))

2.0

In [19]:
df1 = pd.read_json('messy_data.json')
#df1 = df1[['id','height']]

In [20]:
df1

   id  height
0   1   168.0
1   2   155.0
2   3     NaN
3   4   173.0

In [38]:
df1.drop('height',axis=1,inplace=True)

In [39]:
df2 = pd.read_csv('messy_data.csv')

In [40]:
df2

   id  age  weight
0   1   20    11.0
1   2   27     NaN
2   3   25    14.0
3   4 -999    12.0

In [41]:
df2.drop('weight',axis=1,inplace=True)

In [42]:
sum(df2['age'].isnull())

0

In [43]:
df = pd.merge(df1,df2,on='id')

In [44]:
df

   id  age
0   1   20
1   2   27
2   3   25
3   4 -999

In [45]:
df.describe()

             id         age
count  4.000000    4.000000
mean   2.500000 -231.750000
std    1.290994  511.508472
min    1.000000 -999.000000
25%    1.750000 -234.750000
50%    2.500000   22.500000
75%    3.250000   25.500000
max    4.000000   27.000000

In [46]:
df = df[df['age'] > 0]

In [47]:
df['age'].mean()

24.0

In [48]:
df

   id  age
0   1   20
1   2   27
2   3   25